---
title: Gradient
classe: Autodesk.Revit.DB.Visual.Gradient
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 22
---

# Gradient

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String GradientColor { get; }` | `Gradient.GradientColor` | String |
| `String GradientInterpolation { get; }` | `Gradient.GradientInterpolation` | String |
| `String GradientNoise { get; }` | `Gradient.GradientNoise` | String |
| `String GradientNoiseAmount { get; }` | `Gradient.GradientNoiseAmount` | String |
| `String GradientNoiseHigh { get; }` | `Gradient.GradientNoiseHigh` | String |
| `String GradientNoiseLevels { get; }` | `Gradient.GradientNoiseLevels` | String |
| `String GradientNoiseLow { get; }` | `Gradient.GradientNoiseLow` | String |
| `String GradientNoisePhase { get; }` | `Gradient.GradientNoisePhase` | String |
| `String GradientNoiseSize { get; }` | `Gradient.GradientNoiseSize` | String |
| `String GradientNoiseSmooth { get; }` | `Gradient.GradientNoiseSmooth` | String |
| `String GradientPosition { get; }` | `Gradient.GradientPosition` | String |
| `String GradientType { get; }` | `Gradient.GradientType` | String |
| `String TextureLinkTextureTransforms { get; }` | `Gradient.TextureLinkTextureTransforms` | String |
| `String TextureOffsetLock { get; }` | `Gradient.TextureOffsetLock` | String |
| `String TextureRealWorldOffsetX { get; }` | `Gradient.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `Gradient.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldScaleX { get; }` | `Gradient.TextureRealWorldScaleX` | String |
| `String TextureRealWorldScaleY { get; }` | `Gradient.TextureRealWorldScaleY` | String |
| `String TextureScaleLock { get; }` | `Gradient.TextureScaleLock` | String |
| `String TextureURepeat { get; }` | `Gradient.TextureURepeat` | String |
| `String TextureVRepeat { get; }` | `Gradient.TextureVRepeat` | String |
| `String TextureWAngle { get; }` | `Gradient.TextureWAngle` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```